First notebook file for the project

In [2]:
import pandas as pd
import numpy as np

In [42]:
#Absolute temperatures, monthly readings for Estonia
data_abs_est=pd.read_csv("Estonia.csv")
data_est=data_abs_est.drop("Unnamed: 0",axis=1)
data_est.head()

           dt  AverageTemperature  AverageTemperatureUncertainty  Country
0  1752-11-01               1.836                          1.176  Estonia
1  1752-12-01              -2.763                          1.291  Estonia
2  1753-01-01              -6.400                          7.307  Estonia
3  1753-02-01              -6.821                          2.806  Estonia
4  1753-03-01              -0.575                          4.253  Estonia

In [16]:
data_emissions=pd.read_csv("emission data.csv")
world_emissions=data_emissions[data_emissions["Country"]=="World"]
world_emissions

,Country,1751,1752,1753,1754,1755,1756,1757,1758,1759,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
227,World,9350528,18704720,28058912,37416768,46778288,56784672,66794720,76808432,86825808,...,1.260000e+12,1.290000e+12,1.330000e+12,1.360000e+12,1.400000e+12,1.430000e+12,1.470000e+12,1.500000e+12,1.540000e+12,1.580000e+12

In [8]:
#Absolute temperatures monthly global readings
data_absolute=pd.read_csv("GlobalTemperatures.csv")
data_absolute.head()

,dt,LandAverageTemperature,LandAverageTemperatureUncertainty,LandMaxTemperature,LandMaxTemperatureUncertainty,LandMinTemperature,LandMinTemperatureUncertainty,LandAndOceanAverageTemperature,LandAndOceanAverageTemperatureUncertainty
0,1750-01-01,3.034,3.574,NaN,NaN,NaN,NaN,NaN,NaN
1,1750-02-01,3.083,3.702,NaN,NaN,NaN,NaN,NaN,NaN
2,1750-03-01,5.626,3.076,NaN,NaN,NaN,NaN,NaN,NaN
3,1750-04-01,8.490,2.451,NaN,NaN,NaN,NaN,NaN,NaN
4,1750-05-01,11.573,2.072,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
#Temperature variations - temperature readings like these correspond to how different the reading was when compared
#to global average for the years 1900-2000
#Annual readings, 2 dindependent sources: GISTEMP and GCAG
var_annual=pd.read_csv("annual_csv.csv")
data_variations_annual=var_annual.iloc[::-1].reset_index(drop=True)
data_variations_annual.head()

    Source  Year    Mean
0  GISTEMP  1880 -0.2000
1     GCAG  1880 -0.1148
2  GISTEMP  1881 -0.1200
3     GCAG  1881 -0.0628
4  GISTEMP  1882 -0.1000

In [13]:
#Monthly variations
var_month=pd.read_csv("monthly_csv.csv")
data_variations_monthly=var_month.iloc[::-1].reset_index(drop=True)
data_variations_monthly.head()

    Source        Date    Mean
0  GISTEMP  1880-01-06 -0.3000
1     GCAG  1880-01-06  0.0009
2  GISTEMP  1880-02-06 -0.2100
3     GCAG  1880-02-06 -0.1229
4  GISTEMP  1880-03-06 -0.1800

In [30]:
#Data from NOAA, 1880-2019, monthly readings
data_variations_NOAA=pd.read_csv("data-NOAA.csv")
data_variations_NOAA.head()

     Year  Value
0  188001  -0.32
1  188002  -0.70
2  188003  -0.76
3  188004  -0.43
4  188005  -0.24